#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>
```

terraform
data.github_repository.this: Reading...
data.github_repository.this: Read complete after 1s [id=phillies-win-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # azurerm_container_app_environment.example will be created
  + resource "azurerm_container_app_environment" "example" {
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = (known after apply)
      + name                             = "cae-dkopec-1-merge"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "rg-dkopec-1-merge"
      + static_ip_address                = (known after apply)
    }

  # azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "eastus"
      + name                               = "log-dkopec-1-merge"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "rg-dkopec-1-merge"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-dkopec-1-merge"
    }

  # github_repository_environment.this will be created
  + resource "github_repository_environment" "this" {
      + environment = "1-merge"
      + id          = (known after apply)
      + repository  = "phillies-win-api"

      + deployment_branch_policy {
          + custom_branch_policies = false
          + protected_branches     = true
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @dkopec, Action: `pull_request`*